{
    "name": "Shield Placers",
    "icon": "naval_warfare:icon_shield_placer",
    "category": "naval_warfare:abilities/active",
    "pages": [
        {
			"type": "patchouli:text",
			"text": "$(l)(Active-Defensive)/$$(br)Shield Placers are similar to $(l:naval_warfare:abilities/passive/energy_shield)Energy Shields/$, except you can place these yourself during battle. They will remain until destroyed, even if the ship that casted the ability is destroyed."
		},
		{
			"type": "patchouli:text",
			"text": "If multiple shields overlap with eachother and one shield is destroyed, any pieces overlapping with the destroyed shield will remain, so you won't lose both shields at once. Note that when a shield is hit, it will take 1 damage regardless of how much damage the attack would originally have done if it had hit a ship."
		},
		{
			"type": "patchouli:text",
			"text": "$(l)Tips & Tricks/$$(li)Try not to overlap energy shields, as any hits on the overlapping parts will damage BOTH shields! $(li)Most energy shields can protect multiple ships if your ships are close together. However, this may also means that you may lose multiple ships in quick succession once the shield is destroyed." 
		},
		{
			"type": "patchouli:text",
			"text": "$(li)Always check whether your opponent has any ships with an $(l:naval_warfare:abilities/active/energy_overloader)$(thing)Energy Overloader/$ ability, as this ability will instantly destroy any shield hit by it AND the tile below the shield! Try to destroy any ship with this ability as fast as possible to preserve your shields. $(li)Shields DO NOT STOP $(l:abilities/active/torpedo)$(thing)Torpedoes/$!$(li)Your opponent will be notified when they hit your shield, and will see a shield"
		},
		{
			"type": "patchouli:text",
			"text": "tile appear on their targeting board above the tile they fired at. They will likely keep shooting there to break the shield, so keep in mind that any ship located there may only live for a few more rounds (remember that you will lose access to its ability when the ship is destroyed)!$(li)You can place shields anywhere on your board, even if it doesn't protectt any ships. Get creative and you might outsmart your opponent!"
		},
		{
			"type": "patchouli:relations",
			"title": "Ships",
			"entries": [
				"naval_warfare:ships/ship_types/supports/safeguard"
			]
		}
    ]
}